In [1]:
%autosave 0

Autosave disabled

In [2]:
import numpy as np
import pandas as pd
from sqlalchemy import text, create_engine

from env import get_connection

# Exercises I

## Run python -m pip install pymysql from your terminal to install pymysql. ✔️

### Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

#### - 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

✔️

#### - 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

✔️

#### - 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

- the code below would go into a pythn script file to assign the credential data in order to connect to a database to retrieve data you need.
- this would be hidden in a .gitignore folder in order to not display those credentials to the world.

In [3]:
"""
def get_db_url(db, user=username , host=hostname, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/employees'
"""

"\ndef get_db_url(db, user=username , host=hostname, password=password):\n    return f'mysql+pymysql://{user}:{password}@{host}/employees'\n"

#### - 4. Use your function to obtain a connection to the employees database.

- a function was not used, as it was set-up in the lesson

In [4]:
# Get the database connection URL for the 'employees' database
url = get_connection('employees')

# Create a database engine using SQLAlchemy
engine = create_engine(url)

# Define a SQL query to select all columns from the 'employees' table
query = '''
        SELECT *
        FROM employees
        '''

# Create a SQLAlchemy text object for the SQL query
text_query = text(query)

In [5]:
# Use pandas read_sql() to execute the query on the database using the engine,
# and store the result in a DataFrame called 'df'
df = pd.read_sql(text_query, engine.connect())

# Display the first few rows of the DataFrame
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

### - 5. Once you have successfully run a query:

####    -    a. Intentionally make a typo in the database url. What kind of error message do you see?

### OperationalError: (pymysql.err.OperationalError) (2003, "Can't connect to MySQL server on 'data.codeupd.com' ([Errno 8] nodename nor servname provided, or not known)")
### (Background on this error at: https://sqlalche.me/e/14/e3q8)

                        - The error message reads cannot connect to the MySQL server due to a background error at the URL

####    -    b. Intentionally make an error in your SQL query. What does the error message look like?

### ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employeasdes' doesn't exist")
### [SQL: 
###         SELECT *
###         FROM employeasdes
###         ]
### (Background on this error at: https://sqlalche.me/e/14/f405)

                         - The error message reads table does not exist at this url

#### - 6. Read the employees and titles tables into two separate DataFrames.

In [19]:
employee_query = '''
SELECT *
FROM employees
'''

title_query = '''
SELECT *
FROM titles
'''

employee_query = pd.read_sql(text(employee_query), engine.connect())
title_query = pd.read_sql(text(title_query), engine.connect())

In [21]:
employee_query.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [20]:
title_query.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

#### - 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [28]:
employee_query.info

<bound method DataFrame.info of         emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]>

In [30]:
title_query.info

<bound method DataFrame.info of         emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]>

- I did not expect the number shown, but kinf of because we touched SQL beforehand.

#### - 8. Display the summary statistics for each DataFrame.

In [42]:
employee_query.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [39]:
title_query.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

#### - 9. How many unique titles are in the titles DataFrame?

In [61]:
title_query['title'].nunique()

7

#### - 10. What is the oldest date in the to_date column?

In [64]:
title_query['to_date'].min()

datetime.date(1985, 3, 1)

#### -11. What is the most recent date in the to_date column?

In [71]:
title_query['to_date'].max()

datetime.date(9999, 1, 1)